{"Sarah": [{"title": "Basic Chicken Salad", "ingredients": ["½ cup Salad dressing, mayonnaise, soybean oil, with salt", "1 tablespoon Lemon juice, raw", "¼ teaspoon Spices, pepper, black", "2 cups Chicken, roasting, light meat, meat only, cooked, roasted", "½ cup Blanched Slivered Almonds BDG", "1 stalk Celery, raw"], "instructions": "Place almonds in a frying pan. Toast over medium-high heat, shaking frequently. Watch carefully, as they burn easily.\n\nIn a medium bowl, mix together mayonnaise, lemon juice, and pepper. Toss with chicken, almonds, and celery.\n"}, {"title": "Grilled Cheese Sandwich", "ingredients": ["4 slices Bread, white, commercially prepared (includes soft bread crumbs)", "3 tablespoons Butter, with salt", "2 slices Cheese, cheddar"], "instructions": "Preheat skillet over medium heat. Generously butter one side of a slice of bread. Place bread butter-side-down onto skillet bottom and add 1 slice of cheese. Butter a second slice of bread on one side and place butter-side-up on top of sandwich. Grill until lightly browned and flip over; continue grilling until cheese is melted. Repeat with remaining 2 slices of bread, butter and slice of cheese.\n"}, {"title": "Best-Ever Grilled Cheese", "ingredients": ["2 slices ½”-thick Pullman or other white bread", "2 tablespoons mayonnaise", "1 tablespoon unsalted butter", "2 ounces thinly sliced American cheese or cheddar (about 4 slices)", "Freshly ground black pepper", "Campbell’s Tomato Soup (for serving; optional)"], "instructions": "Place bread on a cutting board and spread mayonnaise over top side of each; this is key to a golden, delectable crunch. Heat a small skillet (nonstick, ideally) over medium. Slide in half of butter. When it melts, place 1 slice of bread, mayonnaise side down, in skillet; top with cheese; season with pepper. Top with second slice of bread, mayonnaise side up. When underside is golden brown, about 4 minutes, turn sandwich and add remaining butter to skillet. Press down on sandwich to encourage even browning and to help melt cheese—be gentle, don’t smash it. Cook until second side is golden brown and cheese is melted. Eat immediately, preferably with soup."}]}